{
    "intents": [
        {
            "tag": "saludos",
            "patterns": ["hola", "qué tal", "cómo estás", "saludos", "buenos días", "buenas tardes", "buenas noches"],
            "responses": ["¡Hola! Estoy aquí para resolver tus dudas sobre fotorresistencias.", "¡Hola! ¿Cómo puedo ayudarte hoy?"]
        },
        {
            "tag": "que_es_fotorresistencia",
            "patterns": ["qué es una fotorresistencia", "cómo funciona una fotorresistencia", "para qué sirve una fotorresistencia"],
            "responses": [
                "Una fotorresistencia, o LDR (Light Dependent Resistor), es un dispositivo semiconductor cuya resistencia varía en función de la luz incidente. En oscuridad, su resistencia es alta; con luz, disminuye."
            ]
        },
        {
            "tag": "material_fotorresistencia",
            "patterns": ["de qué material están hechas las fotorresistencias", "qué materiales se usan en las fotorresistencias"],
            "responses": [
                "Están hechas de materiales fotoconductivos como sulfuro de cadmio (CdS) o seleniuro de cadmio (CdSe), que responden a la luz visible."
            ]
        },
        {
            "tag": "usos_fotorresistencia",
            "patterns": ["para qué se usan las fotorresistencias", "qué aplicaciones tienen las fotorresistencias"],
            "responses": [
                "Se utilizan en sensores de luz ambiental, sistemas de encendido automático, control de iluminación en fotografía, medidores de intensidad lumínica y sistemas de barrera óptica."
            ]
        },
        {
            "tag": "longitud_onda",
            "patterns": ["qué longitud de onda afecta la fotorresistencia", "qué rango de luz detecta una fotorresistencia"],
            "responses": [
                "Detectan luz en un rango de 400 a 700 nm. CdS tiene un pico de sensibilidad en 510 nm, y CdSe en 615 nm."
            ]
        },
        {
            "tag": "ventajas_fotorresistencia",
            "patterns": ["cuáles son las ventajas de usar una fotorresistencia"],
            "responses": [
                "Son baratas, fáciles de usar y altamente sensibles a la luz. Funcionan bien en una variedad de aplicaciones prácticas y educativas."
            ]
        },
        {
            "tag": "desventajas_fotorresistencia",
            "patterns": ["cuáles son las desventajas de usar una fotorresistencia"],
            "responses": [
                "Son lentas, dependientes de la temperatura y menos precisas en comparación con otros sensores ópticos, como fotodiodos."
            ]
        },
        {
            "tag": "comparacion_fotodiodo",
            "patterns": ["qué diferencia hay entre una fotorresistencia y un fotodiodo"],
            "responses": [
                "Las fotorresistencias son más simples y baratas, pero los fotodiodos son más rápidos, precisos y adecuados para aplicaciones avanzadas."
            ]
        },
        {
            "tag": "sensibilidad_fotorresistencia",
            "patterns": ["qué afecta la sensibilidad de la fotorresistencia"],
            "responses": [
                "La sensibilidad depende del material, el área de recepción de luz, la longitud de onda incidente y los niveles de impureza."
            ]
        },
        {
            "tag": "velocidad_respuesta",
            "patterns": ["qué tan rápida es una fotorresistencia"],
            "responses": [
                "Son más lentas que otros sensores ópticos. Por ejemplo, CdS tiene un tiempo de respuesta de alrededor de 100 ms."
            ]
        },
        {
            "tag": "historia_fotorresistencia",
            "patterns": ["cuál es la historia de la fotorresistencia", "quién inventó la fotorresistencia"],
            "responses": [
                "Las fotorresistencias se desarrollaron en la primera mitad del siglo XX, basándose en investigaciones sobre materiales fotoconductores."
            ]
        },
        {
            "tag": "tipos_fotorresistencias",
            "patterns": ["qué tipos de fotorresistencias existen"],
            "responses": [
                "Existen fotorresistencias basadas en CdS y CdSe. También varían según el rango de sensibilidad y velocidad de respuesta."
            ]
        },
        {
            "tag": "calculo_resistencia",
            "patterns": ["cómo se calcula la resistencia en una fotorresistencia"],
            "responses": [
                "La resistencia se mide con un multímetro. Puede variar desde varios MΩ en oscuridad hasta menos de 1 kΩ bajo luz intensa."
            ]
        },
        {
            "tag": "problemas_comunes",
            "patterns": ["qué problemas comunes tiene una fotorresistencia"],
            "responses": [
                "Sensibilidad a la luz ambiente, respuesta lenta y envejecimiento del material que puede reducir su efectividad con el tiempo."
            ]
        },
        {
            "tag": "circuitos_basicos",
            "patterns": ["qué circuitos se pueden hacer con fotorresistencias"],
            "responses": [
                "Divisores de voltaje, interruptores automáticos de luz, sistemas de detección de barrera y sensores de luz ambiental."
            ]
        },
        {
            "tag": "aplicaciones_avanzadas",
            "patterns": ["qué aplicaciones avanzadas tienen las fotorresistencias"],
            "responses": [
                "En comunicación óptica, espectrofotómetros, sistemas de control de iluminación avanzada y análisis de luz."
            ]
        },
        {
            "tag": "fotorresistencia_vs_fototransistor",
            "patterns": ["qué diferencia hay entre una fotorresistencia y un fototransistor"],
            "responses": [
                "Los fototransistores son más rápidos y adecuados para aplicaciones que requieren amplificación de señal, mientras que las fotorresistencias son más económicas y fáciles de usar."
            ]
        },
        {
            "tag": "factores_impureza",
            "patterns": ["cómo afecta la impureza a la fotorresistencia"],
            "responses": [
                "Las impurezas en el material pueden alterar la sensibilidad, la velocidad de respuesta y el rango de operación de la fotorresistencia."
            ]
        },
        {
            "tag": "resistencia_minima_maxima",
            "patterns": ["cuál es la resistencia mínima y máxima de una fotorresistencia"],
            "responses": [
                "La resistencia puede variar desde 50Ω a 1kΩ bajo luz intensa, hasta varios MΩ en oscuridad."
            ]
        },
        {
            "tag": "graficas_comportamiento",
            "patterns": ["cómo son las gráficas del comportamiento de una fotorresistencia"],
            "responses": [
                "Las gráficas muestran cómo la resistencia disminuye con la intensidad lumínica. El cambio no es lineal y depende del material."
            ]
        },
        {
            "tag": "iluminacion_vs_distancia",
            "patterns": ["cómo afecta la distancia de la fuente de luz a la fotorresistencia"],
            "responses": [
                "A mayor distancia, disminuye la intensidad de la luz incidente, aumentando la resistencia de la fotorresistencia."
            ]
        },
        {
            "tag": "velocidad_conmutacion",
            "patterns": ["qué tan rápido cambia la resistencia de una fotorresistencia"],
            "responses": [
                "El tiempo de conmutación depende del material. CdS es más lento que otros sensores, con tiempos de hasta 100 ms."
            ]
        },
        {
            "tag": "ejemplo_calculo",
            "patterns": ["puedes darme un ejemplo de cálculo con fotorresistencias"],
            "responses": [
                "Si una fotorresistencia tiene 500Ω bajo luz y se usa en un divisor de voltaje con una resistencia de 1kΩ, el voltaje en la fotorresistencia será: V = (500/(500+1000)) * Vtotal."
            ]
        },
        {
            "tag": "comparacion_fotorresistencias",
            "patterns": ["cómo comparo dos fotorresistencias"],
            "responses": [
                "Se comparan según su rango de sensibilidad, velocidad de respuesta y resistencia máxima/mínima. Elige según tu aplicación."
            ]
        },
        {
            "tag": "temperatura_fotorresistencia",
            "patterns": ["cómo afecta la temperatura a la fotorresistencia"],
            "responses": [
                "La resistencia puede variar con la temperatura. Un aumento en la temperatura generalmente reduce la resistencia."
            ]
        },
        {
            "tag": "precauciones",
            "patterns": ["qué precauciones debo tomar al usar fotorresistencias"],
            "responses": [
                "Evita luz ambiente no controlada, sobrecarga de corriente y exposición prolongada a altas temperaturas."
            ]
        },
        {
            "tag": "tema_desconocido",
            "patterns": ["no sé", "no entiendo", "qué es esto"],
            "responses": [
                "No tengo información sobre eso. Por favor, consulta con un experto o investiga más detalles."
            ]
        }, 
        {
            "tag": "recomendaciones_compra",
            "patterns": ["dónde puedo comprar fotorresistencias", "recomiéndame una tienda para materiales", "dónde conseguir componentes electrónicos"],
            "responses": [
                "Puedes adquirir fotorresistencias y otros componentes electrónicos en tiendas como **Steren**, **Electronica Estudio**, **Mouser Electronics**, o **Amazon**. Si estás en México, también puedes visitar **Mercado Libre** para opciones locales.",
                "Te recomiendo buscar en tiendas en línea como **Digi-Key**, **SparkFun**, o **AliExpress**. Siempre revisa las especificaciones antes de comprar.",
                "Visita tiendas físicas de componentes electrónicos en tu ciudad, como **Stercen** o distribuidoras locales especializadas."
            ]
        }

    ]
}
